Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_collaborator.this["js-libp2p:ckousik"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "js-libp2p"
      + username                    = "ckousik"
    }

  # github_team_repository.this["Admin:js-libp2p-prometheus-metrics"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "js-libp2p-prometheus-metrics"
      + team_id    = "2077192"
    }

  # github_team_repository.this["js-libp2p ChainSafe Maintainers:js-libp2p-prometheus-metrics"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "js-libp2p-prometheus-metrics"
      + team_id    = "6075856"
    }

  # github_team_repository.this["js-libp2p ChainSafe Maintainers:js-libp2p-webtransport"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "js-libp2p-webtransport"
      + team_id    = "6075856"
    }

  # github_team_repository.this["w3dt-stewards:js-libp2p-prometheus-metrics"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "js-libp2p-prometheus-metrics"
      + team_id    = "4657013"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->